Revit 2026 API

# PrintManagerSelectNewPrintDriver Method

---

Select a new printer.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SelectNewPrintDriver(
	string strPrinterName
)
```
```vb
Public Sub SelectNewPrintDriver (
	strPrinterName As String
)
```
```cpp
public:
void SelectNewPrintDriver(
	String^ strPrinterName
)
```
```fsharp
member SelectNewPrintDriver :
        strPrinterName : string -> unit
```

#### Parameters

strPrinterName String
    The name string of new printer.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-strPrinterName-is . |
| InvalidOperationException | Thrown when the assigned new printer is invalid, or the print resource is occupied by others. |

This property is the global print setting property for all documents.

#### Reference

PrintManager Class

Autodesk.Revit.DB Namespace